using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

// C#은 굉장히 고지식한 객체지향 언어

// C#은 클래스의 노예이다.
// 모든 클래스로 통한다.
// 다른 언어들으은 아닌 경우도 있지만
// C#이라는 언어는 클래스를 설명하지 않고는 사실 무엇을 설명한다는 것이 의미가 업슨ㄴ 수준.

// 앞으로 게임을 만들떄
// 게임이라는 것은 굉장히 다양한 개념들을 품고 있다.

// 직업
// 레벨
// 퀘스트
// 적 등등...

// 객체지향은 저 중에서 적절히 묶어서 클래스화시킨다.

// class(클래스를 선언하기 위한 키워드) 이름
// { <- 클래스의 내용의 시작
// 

// 객체지향 -> 내가 표현하고 싶은 것을 클래스로 만들어서
// 그 클래스로 객체를 만드는 프로그래밍이다.
// 객체를 기반으로 모든 것을 해결하기 때문에
// 객체를 지향할 수 밖에 없는 프로그래밍

// 구현과 개념이 분리되지 않는다.
// 

class Inverntory
{

}

// 내가 생각한 개념이
// 내 프로그램에서 사용되어지기 위한
// 설계도를 의미하게 된다.

class Player
{

}

class Pet
{

}

class Monster
{
    // 내부의 내용은 중요하지 않다
}